from наки import tsv
from enum import IntEnum, unique
from каталог.__main__ import направи_карте


@unique
class Извор(IntEnum):
    ИД = 0
    ДАТУМ = 1
    ГЕРМАНСКИ = 2
    ПРЕВОД = 3


def извор_одради(лепа_путања, извор):
    карте = []
    индекс = iter(range(16))

    # 0, 1
    def питање(џ):
        return џ[Извор.ГЕРМАНСКИ]

    def одговор(џ):
        return џ[Извор.ПРЕВОД]

    карте.extend(направи_карте(лепа_путања, извор, "ПРЕВОД <= ГЕРМАНСКИ", питање, одговор, next(индекс)))
    карте.extend(направи_карте(лепа_путања, извор, "ГЕРМАНСКИ <= ПРЕВОД", одговор, питање, next(индекс)))
    return карте, []


def извор_учитај(путања):
    return tsv.учитај_фајл(путања, Извор)
