from наки import tsv
from каталог.__main__ import направи_карте
from collections import namedtuple


Извор = namedtuple('Извор', ['ид', 'датум', 'германски', 'превод'])


def извор_одради(лепа_путања, извор):
    карте = []
    индекс = iter(range(16))
    карте.extend(направи_карте(лепа_путања, извор, "ПРЕВОД <= ГЕРМАНСКИ", Извор.германски.fget, Извор.превод.fget, next(индекс)))
    карте.extend(направи_карте(лепа_путања, извор, "ГЕРМАНСКИ <= ПРЕВОД", Извор.превод.fget, Извор.германски.fget, next(индекс)))
    return карте, []


def извор_учитај(путања):
    return tsv.учитај(путања, tsv.namedtuple(Извор))

