from наки import tsv
from каталог.__main__ import направи_карте
from collections import namedtuple


Извор = namedtuple('Извор', ['ид', 'датум', 'германски', 'превод'])


def извор_одради(лепа_путања, извор):
    карте = []
    индекс = iter(range(16))

    # 0, 1
    def питање(џ):
        return џ.германски

    def одговор(џ):
        return џ.превод

    карте.extend(направи_карте(лепа_путања, извор, "ПРЕВОД <= ГЕРМАНСКИ", питање, одговор, next(индекс)))
    карте.extend(направи_карте(лепа_путања, извор, "ГЕРМАНСКИ <= ПРЕВОД", одговор, питање, next(индекс)))
    return карте, []


def извор_учитај(путања):
    return tsv.учитај(путања, tsv.namedtuple(Извор))

