import re
from наки import tsv
from collections import namedtuple


Извор = namedtuple('Извор', ['ид', 'датум', 'цлозе'])


ЦЛОЗЕ_ПРОГ = re.compile('[{][^:]*:[^}]*[}]')
ЦЛОЗЕ_ПИТАЊЕ = re.compile('[{]([^:]*):[^}]*[}]')
ЦЛОЗЕ_ОДГОВОР = re.compile('[{][^:]*:([^}]*)[}]')


class ЦлозеГрешка(ValueError):
    pass


def формат_уклони_болд(текст):
    текст = текст.replace('[[', 'ДУПЛЕ_КОЦКАСТЕ_ЛЕВЕ').replace(']]', 'ДУПЛЕ_КОЦКАСТЕ_ДЕСНЕ')
    текст = текст.replace('[', '').replace(']', '')
    текст = текст.replace('ДУПЛЕ_КОЦКАСТЕ_ЛЕВЕ', '[[').replace('ДУПЛЕ_КОЦКАСТЕ_ДЕСНЕ', ']]')
    return текст


def формат_цлозе_питање(текст):
    променљиве = ЦЛОЗЕ_ПРОГ.findall(текст)
    if not променљиве:
        raise ЦлозеГрешка(f'Текст нема Цлозе променљивих: {текст}')
    питања = ['{{{' + ЦЛОЗЕ_ПИТАЊЕ.match(п).group(1) + '}}}' for п in променљиве]
    формат = ЦЛОЗЕ_ПРОГ.subn('{}', текст)[0]
    текст = формат.format(*питања)
    текст = формат_уклони_болд(текст)
    return текст


def формат_цлозе_одговор(текст):
    променљиве = ЦЛОЗЕ_ПРОГ.findall(текст)
    if not променљиве:
        raise ЦлозеГрешка(f'Текст нема Цлозе променљивих: {текст}')
    одговори = ['{' + ЦЛОЗЕ_ОДГОВОР.match(п).group(1) + '}' for п in променљиве]
    формат = ЦЛОЗЕ_ПРОГ.subn('{}', текст)[0]
    текст = формат.format(*одговори)
    текст = текст.replace('{} ', '').replace('{}', '')
    return текст


def извор_одради(кг):
    карте = []

    # 0
    def питање(џ):
        return формат_цлозе_питање(џ.цлозе)

    def одговор(џ):
        return формат_цлозе_одговор(џ.цлозе)

    карте.extend(кг("ЦЛОЗЕ", питање, одговор))
    return карте, []


def извор_учитај(путања):
    return tsv.Табела(путања, tsv.namedtuple(Извор)).учитај()

