from наки import tsv
from каталог.__main__ import направи_карте
from collections import namedtuple


Извор = namedtuple('Извор', ['ид', 'датум', 'номинатив', 'генитив', 'датив', 'акузатив'])


def извор_одради(лепа_путања, извор):
    карте = []
    индекс = iter(range(16))

    карте.extend(направи_карте(лепа_путања, извор, "ГЕНИТИВ <= НОМИНАТИВ", Извор.номинатив.fget, Извор.генитив.fget, next(индекс)))
    карте.extend(направи_карте(лепа_путања, извор, "ДАТИВ <= НОМИНАТИВ", Извор.номинатив.fget, Извор.датив.fget, next(индекс)))
    карте.extend(направи_карте(лепа_путања, извор, "АКУЗАТИВ <= НОМИНАТИВ", Извор.номинатив.fget, Извор.акузатив.fget, next(индекс)))

    return карте, []


def извор_учитај(путања):
    return tsv.учитај(путања, tsv.namedtuple(Извор))
