from наки import tsv
from collections import namedtuple


Извор = namedtuple('Извор', ['ид', 'датум', 'номинатив', 'генитив', 'датив', 'акузатив'])


def извор_одради(кг):
    карте = []
    карте.extend(кг("ГЕНИТИВ <= НОМИНАТИВ", Извор.номинатив.fget, Извор.генитив.fget))
    карте.extend(кг("ДАТИВ <= НОМИНАТИВ", Извор.номинатив.fget, Извор.датив.fget))
    карте.extend(кг("АКУЗАТИВ <= НОМИНАТИВ", Извор.номинатив.fget, Извор.акузатив.fget))
    return карте, []


def извор_учитај(путања):
    return tsv.Табела(путања, tsv.namedtuple(Извор)).учитај()
