from наки import tsv
from каталог.__main__ import направи_карте
from collections import namedtuple


Извор = namedtuple('Извор', ['ид', 'датум', 'номинатив', 'генитив', 'датив', 'акузатив'])


def извор_одради(лепа_путања, извор):
    карте = []
    индекс = iter(range(16))

    def питање(џ):
        return џ.номинатив

    # 0
    def одговор(џ):
        return џ.генитив

    карте.extend(направи_карте(лепа_путања, извор, "ГЕНИТИВ <= НОМИНАТИВ", питање, одговор, next(индекс)))

    # 1
    def одговор(џ):
        return џ.датив

    карте.extend(направи_карте(лепа_путања, извор, "ДАТИВ <= НОМИНАТИВ", питање, одговор, next(индекс)))

    # 2
    def одговор(џ):
        return џ.акузатив

    карте.extend(направи_карте(лепа_путања, извор, "АКУЗАТИВ <= НОМИНАТИВ", питање, одговор, next(индекс)))

    return карте, []


def извор_учитај(путања):
    return tsv.учитај(путања, tsv.namedtuple(Извор))
