from наки import tsv
from enum import IntEnum, unique
from каталог.__main__ import направи_карте


@unique
class Извор(IntEnum):
    ИД = 0
    ДАТУМ = 1
    НЕОДРЕЂЕНИ_ЧЛАН = 2
    ЈЕДНИНА = 3
    MNOЖИНА = 4
    ПРЕВОД = 5


def направи_линк(извор):
    ид = извор[Извор.ИД]
    питање = извор[Извор.НЕОДРЕЂЕНИ_ЧЛАН] + ' ' + извор[Извор.ЈЕДНИНА]
    return [ид, f"https://www.google.de/search?tbm=isch&q={питање}"]


def извор_одради(лепа_путања, извор):
    карте = []
    индекс = iter(range(16))

    # 0
    def питање(џ):
        return f"d.. {џ[Извор.ЈЕДНИНА]}"

    def одговор(џ):
        return f"{џ[Извор.НЕОДРЕЂЕНИ_ЧЛАН]} {џ[Извор.ЈЕДНИНА]}"

    карте.extend(направи_карте(лепа_путања, извор, "ЧЛАН <= ЈЕДНИНА", питање, одговор, next(индекс)))

    # 1, 2
    def питање(џ):
        return џ[Извор.ЈЕДНИНА]

    def одговор(џ):
        return џ[Извор.MNOЖИНА]

    карте.extend(направи_карте(лепа_путања, извор, "MNOЖИНА <= ЈЕДНИНА", питање, одговор, next(индекс)))
    карте.extend(направи_карте(лепа_путања, извор, "ЈЕДНИНА <= MNOЖИНА", одговор, питање, next(индекс)))

    # 3, 4
    def питање(џ):
        return џ[Извор.ЈЕДНИНА]

    def одговор(џ):
        return џ[Извор.ПРЕВОД]

    карте.extend(направи_карте(лепа_путања, извор, "PREVOD <= ЈЕДНИНА", питање, одговор, next(индекс)))
    карте.extend(направи_карте(лепа_путања, извор, "ЈЕДНИНА <= PREVOD", одговор, питање, next(индекс)))
    линкови = [направи_линк(и) for и in извор]
    return карте, линкови


def извор_учитај(путања):
    return tsv.учитај_фајл(путања, Извор)
