from наки import tsv
from каталог.__main__ import направи_карте
from collections import namedtuple


Извор = namedtuple('извор', ['ид', 'датум', 'неодређени_члан', 'једнина', 'множина', 'превод'])


def направи_линк(извор):
    питање = извор.неодређени_члан + ' ' + извор.једнина
    return [извор.ид, f"https://www.google.de/search?tbm=isch&q={питање}"]


def извор_одради(лепа_путања, извор):
    карте = []
    индекс = iter(range(16))

    def питање(џ):
        return f"d.. {џ.једнина}"

    def одговор(џ):
        return f"{џ.неодређени_члан} {џ.једнина}"

    # 0
    карте.extend(направи_карте(лепа_путања, извор, "ЧЛАН <= ЈЕДНИНА", питање, одговор, next(индекс)))

    # 1, 2
    карте.extend(направи_карте(лепа_путања, извор, "MNOЖИНА <= ЈЕДНИНА", Извор.једнина.fget, Извор.множина.fget, next(индекс)))
    карте.extend(направи_карте(лепа_путања, извор, "ЈЕДНИНА <= MNOЖИНА", Извор.множина.fget, Извор.једнина.fget, next(индекс)))

    # 3, 4
    карте.extend(направи_карте(лепа_путања, извор, "PREVOD <= ЈЕДНИНА", Извор.једнина.fget, Извор.превод.fget, next(индекс)))
    карте.extend(направи_карте(лепа_путања, извор, "ЈЕДНИНА <= PREVOD", Извор.превод.fget, Извор.једнина.fget, next(индекс)))
    линкови = [направи_линк(и) for и in извор]
    return карте, линкови


def извор_учитај(путања):
    return tsv.учитај(путања, tsv.namedtuple(Извор))

