from наки import tsv
from enum import IntEnum, unique
from наки.карте import направи_карте


@unique
class Извор(IntEnum):
    ИД = 0
    ДАТУМ = 1
    LINKS = 2
    RECHTS = 3
    ЛЕВО = 4
    ДЕСНО = 5


def извор_одради(лепа_путања, извор):
    карте = []
    индекс = iter(range(16))

    # 0, 1
    def питање(џ):
        return f"{џ[Извор.LINKS]} und {џ[Извор.RECHTS]}"

    def одговор(џ):
        return f"{џ[Извор.ЛЕВО]} i {џ[Извор.ДЕСНО]}"

    карте.extend(направи_карте(лепа_путања, извор, "ПРЕВОД <= ГЕРМАНСКИ", питање, одговор, next(индекс)))
    карте.extend(направи_карте(лепа_путања, извор, "ГЕРМАНСКИ <= ПРЕВОД", одговор, питање, next(индекс)))

    # 2, 3
    def питање(џ):
        return f"{џ[Извор.RECHTS]} und {џ[Извор.LINKS]}"

    def одговор(џ):
        return f"{џ[Извор.ДЕСНО]} i {џ[Извор.ЛЕВО]}"

    карте.extend(направи_карте(лепа_путања, извор, "ПРЕВОД <= ГЕРМАНСКИ", питање, одговор, next(индекс)))
    карте.extend(направи_карте(лепа_путања, извор, "ГЕРМАНСКИ <= ПРЕВОД", одговор, питање, next(индекс)))
    return карте, []


def извор_учитај(путања):
    return tsv.учитај_фајл(путања, Извор)
