from наки import tsv
from каталог.__main__ import направи_карте
from collections import namedtuple


Извор = namedtuple('извор', ['ид', 'датум', 'links', 'rechts', 'лево', 'десно'])


def извор_одради(лепа_путања, извор):
    карте = []
    индекс = iter(range(16))

    # 0, 1
    def питање(џ):
        return f"{џ.links} und {џ.rechts}"

    def одговор(џ):
        return f"{џ.лево} i {џ.десно}"

    карте.extend(направи_карте(лепа_путања, извор, "ПРЕВОД <= ГЕРМАНСКИ", питање, одговор, next(индекс)))
    карте.extend(направи_карте(лепа_путања, извор, "ГЕРМАНСКИ <= ПРЕВОД", одговор, питање, next(индекс)))

    # 2, 3
    def питање(џ):
        return f"{џ.rechts} und {џ.links}"

    def одговор(џ):
        return f"{џ.десно} i {џ.лево}"

    карте.extend(направи_карте(лепа_путања, извор, "ПРЕВОД <= ГЕРМАНСКИ", питање, одговор, next(индекс)))
    карте.extend(направи_карте(лепа_путања, извор, "ГЕРМАНСКИ <= ПРЕВОД", одговор, питање, next(индекс)))
    return карте, []


def извор_учитај(путања):
    return tsv.учитај(путања, tsv.namedtuple(Извор))

