from наки import tsv
from каталог.__main__ import направи_карте
from collections import namedtuple


Извор = namedtuple('извор', ['ид', 'датум', 'инфинитив', 'презент', 'претерит', 'перфект', 'превод'])


def направи_линк(извор):
    return [извор.ид, f"https://www.verbformen.de/konjugation/?w={извор.инфинитив}"]


def извор_одради(лепа_путања, извор):
    карте = []
    индекс = iter(range(16))
    # превод на инфинитив
    врста_карте = f"ИНФИНИТИВ <= ПРЕВОД"
    карте.extend(направи_карте(лепа_путања, извор, врста_карте, Извор.превод.fget, Извор.инфинитив.fget, next(индекс)))
    # инфинитив на остало
    имена = ['ПРЕЗЕНТ', 'ПРЕТЕРИТ', 'ПЕРФЕКТ', 'ПРЕВОД']
    гетери = [Извор.презент.fget, Извор.претерит.fget, Извор.перфект.fget, Извор.превод.fget]
    for име, гетер in zip(имена, гетери):
        врста_карте = f"{име} <= ИНФИНИТИВ"
        карте.extend(направи_карте(лепа_путања, извор, врста_карте, Извор.инфинитив.fget, гетер, next(индекс)))
    # све питање
    врста_карте = f"СВЕ <= ПРЕВОД"

    def одговор(џ):
        return ', '.join([џ.инфинитив, џ.презент, џ.претерит, џ.перфект])

    карте.extend(направи_карте(лепа_путања, извор, врста_карте, Извор.превод.fget, одговор, next(индекс)))
    линкови = [направи_линк(и) for и in извор]
    return карте, линкови


def извор_учитај(путања):
    return tsv.учитај(путања, tsv.namedtuple(Извор))

