from наки import tsv
from enum import IntEnum, unique
from наки.карте import направи_карте


@unique
class Извор(IntEnum):
    ИД = 0
    ДАТУМ = 1
    ИНФИНИТИВ = 2
    ПРЕЗЕНТ = 3
    ПРЕТЕРИТ = 4
    ПЕРФЕКТ = 5
    ПРЕВОД = 6


def направи_линк(извор):
    ид = извор[Извор.ИД]
    инфинитив = извор[Извор.ИНФИНИТИВ]
    return [ид, f"https://www.verbformen.de/konjugation/?w={инфинитив}"]


def извор_одради(лепа_путања, извор):
    карте = []
    индекс = iter(range(16))
    # превод на инфинитив
    врста_карте = f"{Извор.ИНФИНИТИВ.name} <= {Извор.ПРЕВОД.name}"

    def питање(џ):
        return џ[Извор.ПРЕВОД]

    def одговор(џ):
        return џ[Извор.ИНФИНИТИВ]
    карте.extend(направи_карте(лепа_путања, извор, врста_карте, питање, одговор, next(индекс)))
    # инфинитив на остало
    for ле in [Извор.ПРЕЗЕНТ, Извор.ПРЕТЕРИТ, Извор.ПЕРФЕКТ, Извор.ПРЕВОД]:
        врста_карте = f"{ле.name} <= {Извор.ИНФИНИТИВ.name}"

        def питање(џ):
            return џ[Извор.ИНФИНИТИВ]

        def одговор(џ):
            return џ[ле]

        карте.extend(направи_карте(лепа_путања, извор, врста_карте, питање, одговор, next(индекс)))
    # све питање
    д = len(Извор)
    врста_карте = f"СВЕ <= {Извор.ПРЕВОД.name}"

    def питање(џ):
        return џ[д-1]

    def одговор(џ):
        return ', '.join(џ[2:д-1])

    карте.extend(направи_карте(лепа_путања, извор, врста_карте, питање, одговор, next(индекс)))
    линкови = [направи_линк(и) for и in извор]
    return карте, линкови


def извор_учитај(путања):
    return tsv.учитај_фајл(путања, Извор)
