from наки import tsv
from collections import namedtuple


Извор = namedtuple('извор', ['ид', 'датум', 'инфинитив', 'презент', 'претерит', 'перфект', 'превод'])


def направи_линк(извор):
    return [извор.ид, f"https://www.verbformen.de/konjugation/?w={извор.инфинитив}"]


def извор_одради(кг):
    карте = []
    # превод на инфинитив
    врста_карте = f"ИНФИНИТИВ <= ПРЕВОД"
    карте.extend(кг(врста_карте, Извор.превод.fget, Извор.инфинитив.fget))
    # инфинитив на остало
    имена = ['ПРЕЗЕНТ', 'ПРЕТЕРИТ', 'ПЕРФЕКТ', 'ПРЕВОД']
    гетери = [Извор.презент.fget, Извор.претерит.fget, Извор.перфект.fget, Извор.превод.fget]
    for име, гетер in zip(имена, гетери):
        врста_карте = f"{име} <= ИНФИНИТИВ"
        карте.extend(кг(врста_карте, Извор.инфинитив.fget, гетер))
    # све питање
    врста_карте = f"СВЕ <= ПРЕВОД"

    def одговор(џ):
        return ', '.join([џ.инфинитив, џ.презент, џ.претерит, џ.перфект])

    карте.extend(кг(врста_карте, Извор.превод.fget, одговор))
    линкови = [направи_линк(и) for и in кг.извор]
    return карте, линкови


def извор_учитај(путања):
    return tsv.Табела(путања, tsv.namedtuple(Извор)).учитај()

