from наки.__main__ import Главна
from наки.вежбање import Вежбање
from тест import ТестТерминал, ТестШпил

ОДРАЂЕНО = 10000


def тв(име, лен):
    return Вежбање(ТестШпил(име, лен))


def тест_вежбања():
    return [
        тв('aaa', 0),
        тв('bbb', 5),
        тв('ccc', 10),
        тв('ddd', 15),
    ]


def test_изађи_одмах():
    рез = Главна(ТестТерминал(['k']), тест_вежбања())()
    assert рез == тест_вежбања()


# def test_преполови():
#     рез = Главна(ТестТерминал(['p', 'k']), тест_вежбања())()
#     for a, б in zip(рез, тест_вежбања()):
#         assert a.име_шпила() == б.име_шпила()
#         assert len(a) == (len(б) + 1) // 2


# def test_избаци_промашене():
#     рез = Главна(ТестТерминал(['и', 'k']), тест_вежбања())()
#     for a, б in zip(рез, тест_вежбања()):
#         assert a.име_шпила() == б.име_шпила()
#         assert len(a) == max(0, len(б) - 2)


# def test_одради_два():
#     рез = Главна(ТестТерминал([2, 3, 'k']), тест_вежбања())()
#     assert рез == [
#         тв('aaa', 0),
#         тв('bbb', ОДРАЂЕНО),
#         тв('ccc', ОДРАЂЕНО),
#         тв('ddd', 15),
#     ]


# def test_мешовито():
#     рез = Главна(ТестТерминал(['i', 1, 'p', 'i', 3, 'k']), тест_вежбања())()
#     assert рез == [
#         тв('aaa', ОДРАЂЕНО),
#         тв('bbb', 2),
#         тв('ccc', ОДРАЂЕНО),
#         тв('ddd', 7),
#     ]
