from pathlib import Path
from наки.вежбање import Вежбање
from наки.шпил import Шпил
from наки.ui import UI
from тест import ТестГлавнаЗидар, ТестВежбањеЗидар
from наки.команда import КОД_СПЕЈС
from наки.команда import КОД_ЕНТЕР
from наки.команда import КОД_ЦИР_К
from наки.команда import КОД_ЦИР_Е
from наки.команда import КОД_ЦИР_О
from наки.команда import КОД_ЦИР_Ф

ПУН_ШПИЛ = 100
БРОЈ_ПРОМАШЕНИХ = ПУН_ШПИЛ // 4


def тт(команде):
    главна = ТестГлавнаЗидар(Path('лажни-каталог'), команде, [ПУН_ШПИЛ])()
    return главна.ui, главна.вежбања[0]


def test_одради_све():
    т, в = тт([КОД_СПЕЈС] * 10000)
    assert len(в) == ПУН_ШПИЛ
    неодрађене, промашене = в(т)
    assert len(в) == 0
    assert неодрађене == 0
    assert промашене == 0


def test_изађи_на_питању():
    т, в = тт([КОД_СПЕЈС] * 4 + [КОД_ЦИР_К])
    assert len(в) == ПУН_ШПИЛ
    неодрађене, промашене = в(т)
    assert len(в) == 0
    assert неодрађене == ПУН_ШПИЛ - 2
    assert промашене == 0


def test_изађи_на_одговору():
    т, в = тт([КОД_СПЕЈС] * 5 + [КОД_ЦИР_К])
    assert len(в) == ПУН_ШПИЛ
    неодрађене, промашене = в(т)
    assert len(в) == 0
    assert неодрађене == ПУН_ШПИЛ - 2
    assert промашене == 0


def test_едит_на_питању():
    т, в = тт([КОД_ЦИР_Е, КОД_ЦИР_К])
    assert len(в) == ПУН_ШПИЛ
    неодрађене, промашене = в(т)
    assert len(в) == 0
    assert неодрађене == ПУН_ШПИЛ
    assert промашене == 0
    assert len(т.т.измене) == 1


def test_едит_на_одговору():
    т, в = тт([КОД_СПЕЈС, КОД_ЦИР_Е, КОД_ЦИР_К])
    assert len(в) == ПУН_ШПИЛ
    неодрађене, промашене = в(т)
    assert len(в) == 0
    assert неодрађене == ПУН_ШПИЛ
    assert промашене == 0
    assert len(т.т.измене) == 1


def test_линк_на_питању():
    т, в = тт([КОД_ЦИР_О, КОД_ЦИР_К])
    assert len(в) == ПУН_ШПИЛ
    неодрађене, промашене = в(т)
    assert len(в) == 0
    assert неодрађене == ПУН_ШПИЛ
    assert промашене == 0
    assert len(т.т.отварања) == 1


def test_линк_на_одговору():
    т, в = тт([КОД_СПЕЈС, КОД_ЦИР_О, КОД_ЦИР_К])
    assert len(в) == ПУН_ШПИЛ
    неодрађене, промашене = в(т)
    assert len(в) == 0
    assert неодрађене == ПУН_ШПИЛ
    assert промашене == 0
    assert len(т.т.отварања) == 1


def test_недозвољенe_командe():
    т, в = тт([КОД_СПЕЈС, 'џ', 'љ', КОД_ЦИР_К])
    assert len(в) == ПУН_ШПИЛ
    неодрађене, промашене = в(т)
    assert len(в) == 0
    assert неодрађене == ПУН_ШПИЛ
    assert промашене == 0
    assert т.т.звукова == 2


def test_неколико_прегледа():
    т, в = тт([КОД_СПЕЈС] * 10 + [КОД_ЦИР_Ф] * 20 + [КОД_ЕНТЕР] * 6 + [КОД_ЦИР_К])
    assert len(в) == ПУН_ШПИЛ
    неодрађене, промашене = в(т)
    assert len(в) == 0
    assert неодрађене == ПУН_ШПИЛ - 18
    assert промашене == 10


def test_преполови():
    т, в = тт([КОД_ЦИР_К])
    в.преполови()
    assert len(в) == ПУН_ШПИЛ // 2
    неодрађене, промашене = в(т)
    assert len(в) == 0
    assert неодрађене == ПУН_ШПИЛ // 2
    assert промашене == 0


def test_избаци_промашене():
    т, в = тт([КОД_ЦИР_К])
    в.избаци_промашене()
    assert len(в) == ПУН_ШПИЛ - БРОЈ_ПРОМАШЕНИХ
    неодрађене, промашене = в(т)
    assert len(в) == 0
    assert неодрађене == ПУН_ШПИЛ - БРОЈ_ПРОМАШЕНИХ
    assert промашене == 0


def test_задржи_само_промашене():
    т, в = тт([КОД_ЦИР_К])
    в.задржи_само_промашене()
    assert len(в) == БРОЈ_ПРОМАШЕНИХ
    неодрађене, промашене = в(т)
    assert len(в) == 0
    assert неодрађене == БРОЈ_ПРОМАШЕНИХ
    assert промашене == 0

