from pathlib import Path
from наки.__main__ import Шпил, Главна


def учитај_шпилове():
    return [Шпил(Path('aaa'), 37),
            Шпил(Path('bb'), 0),
            Шпил(Path('cccc'), 14),
            Шпил(Path('ddd'), 2),
            Шпил(Path('eeeeeee'), 11)]


def одради_шпил(шпил):
    pass


def одабери_шпил(команде):
    и = iter(команде)
    return lambda шпилови, екстра: next(и)


def test_Главна_изађи_одмах():
    г = Главна('терминал', 'каталог')
    г.учитај_шпилове = учитај_шпилове
    г.одради_шпил = одради_шпил
    г.одабери_шпил = одабери_шпил(['к'])
    шпилови = г()
    assert шпилови == учитај_шпилове()


def test_Главна_преполови():
    г = Главна('терминал', 'каталог')
    г.учитај_шпилове = учитај_шпилове
    г.одради_шпил = одради_шпил
    г.одабери_шпил = одабери_шпил(['p', 'k'])
    шпилови = г()
    оригинал = учитај_шпилове()
    for о, ш in zip(оригинал, шпилови):
        assert ш.путања == о.путања
        assert ш.макс_активних == о.макс_активних // 2


def test_Главна_одради2():
    г = Главна('терминал', 'каталог')
    г.учитај_шпилове = учитај_шпилове
    г.одради_шпил = одради_шпил
    г.одабери_шпил = одабери_шпил([4, 1, 'k'])
    шпилови = г()
    оригинал = учитај_шпилове()
    assert шпилови[0].макс_активних == 0
    assert шпилови[1].макс_активних == оригинал[1].макс_активних
    assert шпилови[2].макс_активних == оригинал[2].макс_активних
    assert шпилови[3].макс_активних == 0
    assert шпилови[4].макс_активних == оригинал[4].макс_активних


def test_Главна_мешовито():
    г = Главна('терминал', 'каталог')
    г.учитај_шпилове = учитај_шпилове
    г.одради_шпил = одради_шпил
    г.одабери_шпил = одабери_шпил([3, 'п', 2, 5, 'p', 'к'])
    шпилови = г()
    assert шпилови[0].макс_активних == 9
    assert шпилови[1].макс_активних == 0
    assert шпилови[2].макс_активних == 0
    assert шпилови[3].макс_активних == 0
    assert шпилови[4].макс_активних == 0
