from pathlib import Path
from shutil import copytree
from наки.карте import Вежбање
from тест_терминал import ТестТерминал
from наки.команда import КОМАНДА_ПЛУС1

ТЕСТ_КАТАЛОГ = Path(__file__).parent.parent.joinpath('тест-фајлови', 'каталог')


# def тест_шпилови():
#     return [
#         ('тест_сви_одрађени', 5),
#         ('тест_без_записа_и_линкова', 40),
#         ('тест_без_линкова', 61),
#         ('тест_одрађено_пола', 93),
#         ('тест_без_записа', 95),
#         ('тест_сви_неодрађени', 102),
#     ]


def test_одради_све(tmpdir):
    темп_каталог = Path(tmpdir).joinpath('каталог')
    copytree(ТЕСТ_КАТАЛОГ, темп_каталог)
    тт = ТестТерминал([КОМАНДА_ПЛУС1] * 10000)
    в = Вежбање(темп_каталог.joinpath('тест_без_записа'))
    в(тт)
    assert len(в) == 0
