import pytest
import datetime
from pathlib import Path
from наки.интервали import ПогледИнтервала
from тест import ТестТабела


def ПИВ():
    сирови = []
    сирови.append(["ДАМИР", "2020-04-16", "1, 6, 15, 38, 94, 234, 586, 1465, 3662"])
    сирови.append(["ДАМИР", "2020-05-17", "1, 7, 15, 38, 94, 234, 586, 1465, 3662"])
    сирови.append(["ДАМИР", "2020-04-14", "1, 6, 15, 38, 94, 234, 586, 1465, 3662"])
    сирови.append(["BBB", "2020-04-17", "1, 6, 15, 38, 94, 234, 586, 1465, 3662"])
    сирови.append(["CCC", "2020-04-17", "1, 9, 15, 38, 94, 234, 586, 1465, 3662"])
    тт = ТестТабела(Path('интервали.tsv'), сирови)
    return ПогледИнтервала(тт)


def test_од_сировог():
    пи = ПогледИнтервала.од_сировог(["ДАМИР", "2020-04-17", "1, 6, 15, 38, 94, 234, 586, 1465, 3662"])
    assert пи.врста_карте == "ДАМИР"
    assert пи.датум == datetime.date(2020, 4, 17)
    assert len(пи.интервали) == 9
    assert пи.интервали[0] == 1
    assert пи.интервали[8] == 3662


def test_има_врсту_карте():
    пив = ПИВ()
    assert пив.има_врсту_карте("ДАМИР")
    assert пив.има_врсту_карте("BBB")
    assert пив.има_врсту_карте("CCC")
    assert not пив.има_врсту_карте("ZZZ")


def test_консолидуј():
    пив = ПИВ()
    assert len(пив) == 5
    с = set()
    с.add('ДАМИР')
    пив.консолидуј(с)
    assert len(пив) == 5
    с.add('МЕХ')
    пив.консолидуј(с)
    assert len(пив) == 6


def test_период_интервала():
    пив = ПИВ()
    assert пив.период_интервала('ДАМИР', 1) == 7


def test_период_интервала_нема():
    пив = ПИВ()
    with pytest.raises(KeyError):
        пив.период_интервала('НЕПОЗНАТ', 1)

