# from pathlib import Path
# from shutil import copytree
# from наки.карте import Вежбање

# ТЕСТ_КАТАЛОГ = Path(__file__).parent.parent.joinpath('тест-фајлови', 'каталог')


# def тест_шпилови():
#     return [
#         ('тест_сви_одрађени', 5),
#         ('тест_без_записа_и_линкова', 40),
#         ('тест_без_линкова', 61),
#         ('тест_одрађено_пола', 93),
#         ('тест_без_записа', 95),
#         ('тест_сви_неодрађени', 102),
#     ]




# def test_Вежбање_изађи_одмах(tmpdir):
#     темп_каталог = Path(tmpdir).joinpath('каталог')
#     copytree(ТЕСТ_КАТАЛОГ, темп_каталог)
#     тт = ТестТерминал(['к'])
#     в = Вежбање(темп_каталог)
