from наки.конфигурација import ПУТАЊА_КАТАЛОГА
from наки.вежбање import Вежбање
from наки.шпил import Шпил
from наки.главна import Главна
from наки.терминал import Терминал
from наки.ui import UI
from наки.интервали import ПогледИнтервала, ТабелаИнтервала
from наки.запис import ПогледЗаписа, ТабелаЗаписа
from наки.линкови import ПогледЛинкова, ТабелаЛинкова
from наки.карте import ПогледКарти, ТабелаКарти


class М():
    def каталог(бре):
        return ПУТАЊА_КАТАЛОГА

    def дирови(бре):
        каталог = бре.каталог()
        return [фајл for фајл in каталог.iterdir() if фајл.is_dir() and not фајл.name.startswith('__')]

    def ТабелаИнтервала(бре, дир):
        return ТабелаИнтервала(дир.joinpath('интервали.tsv'))

    def ТабелаКарти(бре, дир):
        return ТабелаКарти(дир.joinpath('карте.tsv'))

    def ТабелаЗаписа(бре, дир):
        return ТабелаЗаписа(дир.joinpath('запис.tsv'))

    def ТабелаЛинкова(бре, дир):
        return ТабелаЛинкова(дир.joinpath('линкови.tsv'))

    def ПогледИнтервала(бре, дир):
        return ПогледИнтервала(бре.ТабелаИнтервала(дир))

    def ПогледКарти(бре, дир):
        return ПогледКарти(бре.ТабелаКарти(дир))

    def ПогледЗаписа(бре, дир):
        return ПогледЗаписа(бре.ТабелаЗаписа(дир))

    def ПогледЛинкова(бре, дир):
        return ПогледЛинкова(бре.ТабелаЛинкова(дир))

    def Шпил(бре, дир):
        п_интервала = бре.ПогледИнтервала(дир)
        п_карти = бре.ПогледКарти(дир)
        п_записа = бре.ПогледЗаписа(дир)
        п_линкова = бре.ПогледЛинкова(дир)
        return Шпил(дир.name, п_интервала, п_карти, п_линкова, п_записа)

    def шпилови(бре):
        return [бре.Шпил(дир) for дир in бре.дирови()]

    def вежбања(бре):
        вежбања = [Вежбање(бре.каталог(), шпил) for шпил in бре.шпилови()]
        вежбања.sort(key=lambda в: len(в))
        return вежбања

    def Терминал(бре):
        return Терминал()

    def UI(бре):
        return UI(бре.Терминал())

    def Главна(бре):
        return Главна(бре.UI(), бре.вежбања())


def главна():
    м = М()
    м.Главна()()


if __name__ == '__main__':
    главна()

