import os
import sys
import readchar
import subprocess
from blessings import Terminal
from наки.терминал import Терминал
from наки.конфигурација import ПУТАЊА_КАТАЛОГА
from наки.вежбање import Вежбање
from наки.команда import Регистар, КОМАНДА_ПРЕКИД, КОМАНДА_ИЗБАЦИ_ПРОМАШЕНЕ, КОМАНДА_ПРЕПОЛОВИ
from наки.команда import КОМАНДА_ЗАДРЖИ_САМО_ПРОМАШЕНЕ
from наки.команда import команда_индекс
from наки.карте import Шпил, шпил_диск_лоадер
from наки.ui import UI


def учитај_вежбања(каталог):
    дирови = [фајл for фајл in каталог.iterdir() if фајл.is_dir() and not фајл.name.startswith('__')]
    return [Вежбање(каталог, Шпил(**шпил_диск_лоадер(дир))) for дир in дирови]


class Главна():

    def __init__(бре, ui, вежбања):
        бре.ui = ui
        бре.вежбања = вежбања
        бре.прекид = False
        бре.регистар = Регистар()
        бре.регистар.региструј(КОМАНДА_ПРЕКИД, бре.а_прекид)
        бре.регистар.региструј(КОМАНДА_ИЗБАЦИ_ПРОМАШЕНЕ, бре.а_избаци_промашене)
        бре.регистар.региструј(КОМАНДА_ЗАДРЖИ_САМО_ПРОМАШЕНЕ, бре.а_задржи_само_промашене)
        бре.регистар.региструј(КОМАНДА_ПРЕПОЛОВИ, бре.а_преполови)
        бре.регистар.региструј(команда_индекс(len(бре.вежбања)), бре.а_индекс)

    def а_прекид(бре, к):
        бре.прекид = True

    def а_избаци_промашене(бре, к):
        for в in бре.вежбања:
            в.избаци_промашене()

    def а_задржи_само_промашене(бре, к):
        for в in бре.вежбања:
            в.задржи_само_промашене()

    def а_преполови(бре, к):
        for в in бре.вежбања:
            в.преполови()

    def а_индекс(бре, к):
        бре.вежбања[int(к) - 1](бре.ui)

    def __call__(бре):
        порука = [
            'бројем одабери шпил',
            '"i" да избациш промашене',
            '"r" да задржиш само промашене',
            '"p" да преполовиш',
            '"k" за крај',
        ]
        while not бре.прекид:
            приказ = [f"[{len(в)}] {в.име_шпила()}" for в in бре.вежбања]
            бре.ui.одабери_шпил(приказ, порука, бре.регистар)
        return [в.сиже() for в in бре.вежбања]


def измени(путања, линија):
    subprocess.run(['vim', '+' + линија, '+normal_WW', str(путања)])


def отвори_урл(урл):
    if sys.platform == 'win32':
        os.startfile(урл)
    elif sys.platform == 'darwin':
        subprocess.Popen(['open', урл])
    else:
        subprocess.Popen(['xdg-open', урл])


def звук_грешке():
    print('\a', end='', flush=True)


def главна():
    вежбања = учитај_вежбања(ПУТАЊА_КАТАЛОГА)
    вежбања.sort(key=lambda в: len(в))
    terminal = Terminal()
    # залепи сирове метода на терминал објекат, лакше него завити у нову класу
    terminal.readkey = readchar.readkey
    terminal.input = input
    terminal.print = print
    terminal.измени = измени
    terminal.звук_грешке = звук_грешке
    terminal.отвори_урл = отвори_урл
    # ајмо
    Главна(UI(Терминал(terminal)), вежбања)()


if __name__ == '__main__':
    главна()
