import readchar
from blessings import Terminal
from наки.терминал import Терминал
from наки.конфигурација import ПУТАЊА_КАТАЛОГА
from наки.вежбање import Вежбање
from наки.команда import КОМАНДА_ПРЕКИД, КОМАНДА_ИЗБАЦИ_ПРОМАШЕНЕ, КОМАНДА_ПРЕПОЛОВИ


def учитај_вежбања(каталог):
    шпилови = [шпил for шпил in каталог.iterdir() if шпил.is_dir() and not шпил.name.startswith('__')]
    return [Вежбање(шпил) for шпил in шпилови]


class Главна():

    def __init__(бре, терминал, вежбања):
        бре.терминал = терминал
        бре.вежбања = вежбања

    def одабери_шпил(бре, екстра):
        приказ = [f"[{len(в)}] {в.име_шпила()}" for в in бре.вежбања]
        порука = 'бројем одабери шпил, "и" да избациш промашене, "п" да преполовиш, "к" за крај'
        индекс = бре.терминал.одабери_један(приказ, порука, екстра)
        return индекс

    def __call__(бре):
        екстра_команде = [КОМАНДА_ПРЕКИД, КОМАНДА_ИЗБАЦИ_ПРОМАШЕНЕ, КОМАНДА_ПРЕПОЛОВИ]

        def екстра(и):
            for к in екстра_команде:
                if и in к:
                    return к
            return None

        while True:
            к = бре.одабери_шпил(екстра)
            if к in КОМАНДА_ИЗБАЦИ_ПРОМАШЕНЕ:
                for в in бре.вежбања:
                    в.избаци_промашене()
            elif к in КОМАНДА_ПРЕПОЛОВИ:
                for в in бре.вежбања:
                    в.преполови()
            elif к in КОМАНДА_ПРЕКИД:
                return бре.вежбања
            else:
                бре.вежбања[к - 1](бре.терминал)


def главна():
    вежбања = учитај_вежбања(ПУТАЊА_КАТАЛОГА)
    вежбања.sort(key=lambda в: len(в))
    terminal = Terminal()
    # залепи сирове метода на терминал објекат, лакше него завити у нову класу
    terminal.readkey = readchar.readkey
    terminal.input = input
    terminal.print = print
    # ајмо
    Главна(Терминал(terminal), вежбања)()


if __name__ == '__main__':
    главна()
