from наки.терминал import Терминал
from наки.конфигурација import ПУТАЊА_КАТАЛОГА
from наки.вежбање import Вежбање
from наки.команда import Регистар, КОМАНДА_ПРЕКИД, КОМАНДА_ИЗБАЦИ_ПРОМАШЕНЕ, КОМАНДА_ПРЕПОЛОВИ
from наки.команда import КОМАНДА_ЗАДРЖИ_САМО_ПРОМАШЕНЕ
from наки.команда import команда_индекс
from наки.шпил import Шпил
from наки.ui import UI


class Главна():

    @staticmethod
    def направи(каталог):
        дирови = [фајл for фајл in каталог.iterdir() if фајл.is_dir() and not фајл.name.startswith('__')]
        вежбања = [Вежбање(каталог, Шпил.учитај(дир)) for дир in дирови]
        вежбања.sort(key=lambda в: len(в))
        return Главна(UI(Терминал()), вежбања)

    def __init__(бре, ui, вежбања):
        бре.ui = ui
        бре.вежбања = вежбања
        бре.прекид = False
        бре.регистар = Регистар()
        бре.регистар.региструј(КОМАНДА_ПРЕКИД, бре.а_прекид)
        бре.регистар.региструј(КОМАНДА_ИЗБАЦИ_ПРОМАШЕНЕ, бре.а_избаци_промашене)
        бре.регистар.региструј(КОМАНДА_ЗАДРЖИ_САМО_ПРОМАШЕНЕ, бре.а_задржи_само_промашене)
        бре.регистар.региструј(КОМАНДА_ПРЕПОЛОВИ, бре.а_преполови)
        бре.регистар.региструј(команда_индекс(len(бре.вежбања)), бре.а_индекс)

    def а_прекид(бре, к):
        бре.прекид = True

    def а_избаци_промашене(бре, к):
        for в in бре.вежбања:
            в.избаци_промашене()

    def а_задржи_само_промашене(бре, к):
        for в in бре.вежбања:
            в.задржи_само_промашене()

    def а_преполови(бре, к):
        for в in бре.вежбања:
            в.преполови()

    def а_индекс(бре, к):
        бре.вежбања[int(к) - 1](бре.ui)

    def __call__(бре):
        порука = [
            'бројем одабери шпил',
            '"и" да избациш машене',
            '"м" да задржиш само машене',
            '"п" да преполовиш',
            '"к" за крај',
        ]
        while not бре.прекид:
            приказ = [f"[{len(в)}] {в.име_шпила()}" for в in бре.вежбања]
            бре.ui.одабери_шпил(приказ, порука, бре.регистар)
        return [в.сиже() for в in бре.вежбања]


def главна():
    Главна.направи(ПУТАЊА_КАТАЛОГА)()


if __name__ == '__main__':
    главна()
