from наки.команда import КОМАНДА_ПРЕКИД, КОМАНДА_ИЗБАЦИ_ПРОМАШЕНЕ, КОМАНДА_ПРЕПОЛОВИ
from наки.команда import КОМАНДА_ЗАДРЖИ_САМО_ПРОМАШЕНЕ
from наки.команда import стринг_команда
from наки.команда import КОМАНДА_ОТВОРИ_УРЛ, КОМАНДА_ЕДИТУЈ
from наки.команда import КОМАНДА_ФЕЈЛ, КОМАНДА_ПЛУС1, КОМАНДА_ПЛУС2


class UI():
    def __init__(бре, стање, терминал, регистар):
        бре.стање = стање
        бре.т = терминал
        бре._регистар = регистар

    def на_прекид(бре, фунц):
        бре._регистар.региструј(КОМАНДА_ПРЕКИД, фунц)

    def на_избаци_промашене(бре, фунц):
        бре._регистар.региструј(КОМАНДА_ИЗБАЦИ_ПРОМАШЕНЕ, фунц)

    def на_задржи_само_промашене(бре, фунц):
        бре._регистар.региструј(КОМАНДА_ЗАДРЖИ_САМО_ПРОМАШЕНЕ, фунц)

    def на_преполови(бре, фунц):
        бре._регистар.региструј(КОМАНДА_ПРЕПОЛОВИ, фунц)

    def на_индекс(бре, фунц, индекс):
        бре._регистар.региструј(стринг_команда(str(индекс)), фунц, индекс=индекс)

    def на_отвори_урл(бре, фунц, **парамс):
        бре._регистар.региструј(КОМАНДА_ОТВОРИ_УРЛ, фунц, **парамс)

    def на_едитуј(бре, фунц, **парамс):
        бре._регистар.региструј(КОМАНДА_ЕДИТУЈ, фунц, **парамс)

    def на_фејл(бре, фунц, **парамс):
        бре._регистар.региструј(КОМАНДА_ФЕЈЛ, фунц, **парамс)

    def на_плус1(бре, фунц, **парамс):
        бре._регистар.региструј(КОМАНДА_ПЛУС1, фунц, **парамс)

    def на_плус2(бре, фунц, **парамс):
        бре._регистар.региструј(КОМАНДА_ПЛУС2, фунц, **парамс)

    def отвори_урл(бре, урл):
        бре.т.отвори_урл(урл)

    def измени(бре, путања, линија):
        бре.т.измени(путања, линија)

    def додај_нa_извор(бре, путања):
        бре.т.додај_на_извор(путања)

    def _принт_мд(бре, текст):
        """ принт маркдовн текст """
        assert текст is not None
        for т in бре.т.формат_мд(текст).split('\\n'):
            бре.т.принт(т)

    def _принт_наслов(бре, текст):
        промена_наслова = бре.стање.наслов(текст)
        if бре.стање.зелено:
            бре.т.принт_зелено(текст)
        else:
            бре.т.принт_плаво(текст)
        бре.т.принт()
        return промена_наслова

    def _принт_сепаратор(бре, c, број=None):
        if број is None:
            бре.т.принт_сиво(c * 60)
        else:
            бре.т.принт_сиво((c * 1) + f"[{број}]" + (c * (59 - len(f"[{број}]"))))

    def _принт_питање(бре, питање, број_преосталих_карата):
        бре._принт_мд(питање)
        бре._принт_сепаратор('-')
        with бре.т.статус():
            бре._принт_сепаратор('=', број_преосталих_карата)
            бре.т.принт('притисни било који тастер')

