class UI():
    def __init__(бре, терминал):
        бре.т = терминал

    def одабери_шпил(бре, листа, опис, регистар):
        while True:
            бре.т.обриши()
            with бре.т.статус():
                бре.т.принт_сепаратор('=')
                if isinstance(опис, list):
                    for о in опис:
                        бре.т.принт(о)
                else:
                    бре.т.принт(опис)
            with бре.т.главни():
                бре.т.принт_листа(листа)
                индекс = бре.т.инпут('#? ').strip()
                if регистар.изврши(индекс):
                    return
                бре.т.звук_грешке()

    def _принт_питање(бре, наслов, питање, број_преосталих_карата):
        бре.т.принт_наслов(наслов)
        бре.т.принт_мд(питање)
        бре.т.принт_сепаратор('-')
        with бре.т.статус():
            бре.т.принт_сепаратор('=', број_преосталих_карата)
            бре.т.принт('притисни било који тастер')

    def отвори_урл(бре, урл):
        if урл:
            бре.т.отвори_урл(урл)
        else:
            бре.т.звук_грешке()

    def измени(бре, права_путања, линија):
        бре.т.измени(права_путања, линија)

    def питање(бре, регистар, дата, наслов, питање, број_преосталих_карата):
        бре.т.обриши()
        with бре.т.главни():
            бре._принт_питање(наслов, питање, број_преосталих_карата)
            к = бре.т.инпут_код()
            return not регистар.изврши(к, **дата)

    def одговор(бре, регистар, дата, наслов, питање, одговор, број_преосталих_карата):
        бре.т.обриши()
        with бре.т.главни():
            бре._принт_питање(наслов, питање, број_преосталих_карата)
            бре.т.принт_мд(одговор)
            with бре.т.статус():
                бре.т.принт_сепаратор('=', број_преосталих_карата)
                бре.т.принт('оцени одговор (f: 0)(space: +1)(enter: +2)')
                к = бре.т.инпут_код()
                if регистар.изврши(к, **дата):
                    return
                бре.т.звук_грешке()
