from наки.команда import КОМАНДА_ПРЕКИД, КОМАНДА_ИЗБАЦИ_ПРОМАШЕНЕ, КОМАНДА_ПРЕПОЛОВИ
from наки.команда import КОМАНДА_ЗАДРЖИ_САМО_ПРОМАШЕНЕ
from наки.команда import стринг_команда
from наки.команда import КОМАНДА_ОТВОРИ_УРЛ, КОМАНДА_ЕДИТУЈ
from наки.команда import КОМАНДА_ФЕЈЛ, КОМАНДА_ПЛУС1, КОМАНДА_ПЛУС2


class UI():
    def __init__(бре, терминал, регистар):
        бре.т = терминал
        бре._регистар = регистар

    def на_прекид(бре, фунц):
        бре._регистар.региструј(КОМАНДА_ПРЕКИД, фунц)

    def на_избаци_промашене(бре, фунц):
        бре._регистар.региструј(КОМАНДА_ИЗБАЦИ_ПРОМАШЕНЕ, фунц)

    def на_задржи_само_промашене(бре, фунц):
        бре._регистар.региструј(КОМАНДА_ЗАДРЖИ_САМО_ПРОМАШЕНЕ, фунц)

    def на_преполови(бре, фунц):
        бре._регистар.региструј(КОМАНДА_ПРЕПОЛОВИ, фунц)

    def на_индекс(бре, фунц, индекс):
        бре._регистар.региструј(стринг_команда(str(индекс)), фунц, индекс=индекс)

    def на_отвори_урл(бре, фунц, **парамс):
        бре._регистар.региструј(КОМАНДА_ОТВОРИ_УРЛ, фунц, **парамс)

    def на_едитуј(бре, фунц, **парамс):
        бре._регистар.региструј(КОМАНДА_ЕДИТУЈ, фунц, **парамс)

    def на_фејл(бре, фунц, **парамс):
        бре._регистар.региструј(КОМАНДА_ФЕЈЛ, фунц, **парамс)

    def на_плус1(бре, фунц, **парамс):
        бре._регистар.региструј(КОМАНДА_ПЛУС1, фунц, **парамс)

    def на_плус2(бре, фунц, **парамс):
        бре._регистар.региструј(КОМАНДА_ПЛУС2, фунц, **парамс)

