class UI():
    def __init__(бре, терминал):
        бре.т = терминал
        бре._претходни_текст = ""
        бре._зелено = False

    def одабери_шпил(бре, листа, опис, регистар):
        with бре.т.пун_екран():
            while True:
                бре.т.обриши()
                with бре.т.статус():
                    бре._принт_сепаратор('=')
                    if isinstance(опис, list):
                        for о in опис:
                            бре.т.принт(о)
                    else:
                        бре.т.принт(опис)
                with бре.т.главни():
                    бре._принт_листа(листа)
                    индекс = бре.т.инпут('#? ').strip()
                    if регистар.изврши(индекс):
                        return
                    бре.т.звук_грешке()

    def _принт_мд(бре, текст):
        """ принт маркдовн текст """
        assert текст is not None
        for т in бре.т.формат_мд(текст).split('\\n'):
            бре.т.принт(т)

    def _принт_листа(бре, листа):
        for индекс, елемент in enumerate(листа, 1):
            бре.т.принт(f"{индекс}) {елемент}")

    def _принт_наслов(бре, текст):
        if бре._претходни_текст != текст:
            бре._зелено = not бре._зелено
        бре._претходни_текст = текст
        if бре._зелено:
            бре.т.принт_зелено(текст)
        else:
            бре.т.принт_плаво(текст)
        бре.т.принт()

    def _принт_сепаратор(бре, c, број=None):
        if број is None:
            бре.т.принт_сиво(c * 60)
        else:
            бре.т.принт_сиво((c * 1) + f"[{број}]" + (c * (59 - len(f"[{број}]"))))

    def _принт_питање(бре, наслов, питање, број_преосталих_карата):
        бре._принт_наслов(наслов)
        бре._принт_мд(питање)
        бре._принт_сепаратор('-')
        with бре.т.статус():
            бре._принт_сепаратор('=', број_преосталих_карата)
            бре.т.принт('притисни било који тастер')

    def питање(бре, регистар, дата, наслов, питање, број_преосталих_карата):
        with бре.т.пун_екран():
            with бре.т.сакривен_курсор():
                бре.т.обриши()
                with бре.т.главни():
                    бре._принт_питање(наслов, питање, број_преосталих_карата)
                    к = бре.т.инпут_код()
                    return not регистар.изврши(к, **дата)

    def одговор(бре, регистар, дата, наслов, питање, одговор, број_преосталих_карата):
        with бре.т.пун_екран():
            with бре.т.сакривен_курсор():
                бре.т.обриши()
                with бре.т.главни():
                    бре._принт_питање(наслов, питање, број_преосталих_карата)
                    бре._принт_мд(одговор)
                    with бре.т.статус():
                        бре._принт_сепаратор('=', број_преосталих_карата)
                        бре.т.принт('оцени одговор (f: 0)(space: +1)(enter: +2)')
                        к = бре.т.инпут_код()
                        if регистар.изврши(к, **дата):
                            return
                        бре.т.звук_грешке()

    def отвори_урл(бре, урл):
        бре.т.отвори_урл(урл)

    def измени(бре, путања, линија):
        бре.т.измени(путања, линија)

    def додај_нa_извор(бре, путања):
        бре.т.додај_на_извор(путања)
