from наки.команда import КОМАНДА_ПРЕКИД, КОМАНДА_ИЗБАЦИ_ПРОМАШЕНЕ, КОМАНДА_ПРЕПОЛОВИ
from наки.команда import КОМАНДА_ЗАДРЖИ_САМО_ПРОМАШЕНЕ
from наки.команда import стринг_команда


class ГлавнаUI():
    def __init__(бре, терминал, регистар):
        бре.т = терминал
        бре._претходни_текст = ""
        бре._зелено = False
        бре._регистар = регистар

    def на_прекид(бре, фунц):
        бре._регистар.региструј(КОМАНДА_ПРЕКИД, фунц)

    def на_избаци_промашене(бре, фунц):
        бре._регистар.региструј(КОМАНДА_ИЗБАЦИ_ПРОМАШЕНЕ, фунц)

    def на_задржи_само_промашене(бре, фунц):
        бре._регистар.региструј(КОМАНДА_ЗАДРЖИ_САМО_ПРОМАШЕНЕ, фунц)

    def на_преполови(бре, фунц):
        бре._регистар.региструј(КОМАНДА_ПРЕПОЛОВИ, фунц)

    def на_индекс(бре, фунц, индекс):
        бре._регистар.региструј(стринг_команда(str(индекс)), фунц, индекс=индекс)

    def одабери_шпил(бре, листа, опис):
        with бре.т.пун_екран():
            while True:
                бре.т.обриши()
                with бре.т.статус():
                    бре._принт_сепаратор('=')
                    if isinstance(опис, list):
                        for о in опис:
                            бре.т.принт(о)
                    else:
                        бре.т.принт(опис)
                with бре.т.главни():
                    бре._принт_листа(листа)
                    индекс = бре.т.инпут('#? ').strip()
                    if бре._регистар.изврши(индекс, индекс=индекс):
                        return
                    бре.т.звук_грешке()

    def _принт_листа(бре, листа):
        for индекс, елемент in enumerate(листа, 1):
            бре.т.принт(f"{индекс}) {елемент}")

    def _принт_сепаратор(бре, c, број=None):
        if број is None:
            бре.т.принт_сиво(c * 60)
        else:
            бре.т.принт_сиво((c * 1) + f"[{број}]" + (c * (59 - len(f"[{број}]"))))

