class Главна():
    def __init__(бре, ui, шпилови):
        бре.шпилови = шпилови
        бре.прекид = False
        бре.ui = ui
        бре.ui.на_прекид(бре.а_прекид)
        бре.ui.на_избаци_промашене(бре.а_избаци_промашене)
        бре.ui.на_задржи_само_промашене(бре.а_задржи_само_промашене)
        бре.ui.на_преполови(бре.а_преполови)
        бре.ui.на_индекс(бре.а_индекс, len(бре.шпилови))

    def а_прекид(бре, к):
        бре.прекид = True

    def а_избаци_промашене(бре, к):
        for в in бре.шпилови:
            в.избаци_промашене()

    def а_задржи_само_промашене(бре, к):
        for в in бре.шпилови:
            в.задржи_само_промашене()

    def а_преполови(бре, к):
        for в in бре.шпилови:
            в.преполови()

    def а_индекс(бре, к):
        бре.шпилови[int(к) - 1]()

    def припреми(бре):
        for вежба in бре.шпилови:
            вежба.припреми()
        бре.шпилови.sort(key=lambda в: len(в))

    def __call__(бре):
        порука = [
            'бројем одабери шпил',
            '"и" да избациш машене',
            '"м" да задржиш само машене',
            '"п" да преполовиш',
            '"к" за крај',
        ]
        while not бре.прекид:
            приказ = [f"[{len(в)}] {в.име()}" for в in бре.шпилови]
            бре.ui.одабери_шпил(приказ, порука)
        return [в.сиже() for в in бре.шпилови]

