import time
from наки.ид import assert_ид
from datetime import date
from collections import namedtuple, Counter
from наки.интервали import БРОЈ_ИНТЕРВАЛА
from наки import tsv


Запис = namedtuple('Запис', [
    'карта_ид',
    'датум_прегледа',
    'време_прегледа',
    'резултат_прегледа',
    'нови_интервал'
])

Запис = tsv.namedtuple(Запис)


class ПогледЗаписа():
    def _парсирај(бре, з):
        ид = з.карта_ид
        assert_ид(ид)
        оцена = int(з.резултат_прегледа)
        бре._последња_оцена[ид] = оцена
        if оцена > 0:
            бре._нови_интервал[ид] = int(з.нови_интервал)
            бре._датум_прегледа[ид] = date.fromisoformat(з.датум_прегледа)

    def __init__(бре, табела):
        бре._табела = табела
        бре._последња_оцена = {}
        бре._нови_интервал = Counter()
        бре._датум_прегледа = {}
        бре._табела.учитај()
        for з in бре._табела:
            бре._парсирај(з)

    def датум_прегледа(бре, ид):
        давно = date.fromisoformat('1970-01-01')
        return бре._датум_прегледа.get(ид, давно)

    def индекс_интервала(бре, ид):
        return бре._нови_интервал[ид] - 1

    def додај_нови_интервал(бре, ид, оцена):
        бре._нови_интервал[ид] = min(бре._нови_интервал[ид] + оцена, БРОЈ_ИНТЕРВАЛА)
        ред = [
            ид,
            time.strftime('%Y-%m-%d'),
            time.strftime('%H:%M:%S%z'),
            оцена,
            бре._нови_интервал[ид],
        ]
        елемент = Запис(*ред)
        бре._парсирај(елемент)
        бре._табела.додај([елемент])

    def промашена(бре, ид):
        return бре._последња_оцена.get(ид, 10000) > 0

    def стат_скуп_идјева(бре):
        return set(з.карта_ид for з in бре._табела)

    def стат_број_карти_по_интервалу(бре):
        задњи_интервали = {}
        for за in бре._табела:
            задњи_интервали[за.карта_ид] = int(за.нови_интервал)
        рез = [0] * БРОЈ_ИНТЕРВАЛА
        for _, зи in задњи_интервали.items():
            рез[зи] += 1
        return рез

    def стат_проценат_промашених_карти(бре):
        пром = len([за for за in бре._табела if int(за.резултат_прегледа) == 0])
        return int(100 * пром / len(бре._табела))

