import sys
import time
from random import shuffle
from collections import defaultdict
from datetime import date, timedelta
from collections import Counter
from enum import IntEnum, unique
from наки import tsv


@unique
class Карта(IntEnum):
    ИД = 0
    ВРСТА_КАРТЕ = 1
    ПИТАЊЕ = 2
    ОДГОВОР = 3
    ИЗВОР = 4
    ЛИНИЈА = 5


@unique
class Запис(IntEnum):
    КАРТА_ИД = 0
    ДАТУМ_ПРЕГЛЕДА = 1
    ВРЕМЕ_ПРЕГЛЕДА = 2
    РЕЗУЛТАТ_ПРЕГЛЕДА = 3
    НОВИ_ИНТЕРВАЛ = 4


@unique
class Линк(IntEnum):
    ИД = 0
    УРЛ = 1


@unique
class Интервали(IntEnum):
    ВРСТА_КАРТЕ = 0
    ДАТУМ = 1
    И1 = 2
    И2 = 3
    И3 = 4
    И4 = 5
    И5 = 6
    И6 = 7
    И7 = 8
    И8 = 9
    И9 = 10


МАКС_ИНТЕРВАЛ = len(Интервали)


def направи_карте(извор_фајл, извор, врста_карте, ф_питање, ф_одговор, индекс):
    """ постарај се да индекс буде јединствен при сваком позиву """
    assert 0 <= индекс and индекс < 16
    карте = []
    for линија, џ in enumerate(извор, 2):
        ид = џ[0]  # претпоставка је да је нулто поље ИД
        assert ид[-1] == '0', 'извор ид мора да се завршава са нулом: ' + ид
        ид = ид[:-1] + hex(индекс)[-1]
        карте.append([ид, врста_карте, ф_питање(џ), ф_одговор(џ), извор_фајл, линија])
    return карте


def извор_ид(карта_ид):
    return карта_ид[:-1] + '0'


def данас():
    # TODO: impl
    return "2020-04-13"


def основни_интервали(врста_карте):
    return [врста_карте, данас(), "1", "6", "15", "38", "94", "234", "586", "1465", "3662"]


# TODO: издвој валидацију и консолидацију стања у посебну фазу која се зове пре наки!
def шпил_диск_лоадер(дир):
    интервали_фајл = дир.joinpath('интервали.tsv')
    интервали = tsv.учитај_фајл(интервали_фајл, Интервали) if интервали_фајл.exists() else []
    скуп_интервала = set()
    for интервал in интервали:
        скуп_интервала.add(интервал[Интервали.ВРСТА_КАРТЕ])
    карте = tsv.учитај_фајл(дир.joinpath('карте.tsv'), Карта)
    скуп_врста_карте = set()
    for карта in карте:
        скуп_врста_карте.add(карта[Карта.ВРСТА_КАРТЕ])
    нови_интервали = []
    for врста_карте in скуп_врста_карте:
        if врста_карте not in скуп_интервала:
            нови_интервали.append(основни_интервали(врста_карте))
    if нови_интервали:
        tsv.додај_на_фајл(интервали_фајл, Интервали, нови_интервали)
        интервали = tsv.учитај_фајл(интервали_фајл, Интервали)
    линкови_фајл = дир.joinpath('линкови.tsv')
    линкови = tsv.учитај_фајл(линкови_фајл, Линк) if линкови_фајл.exists() else []
    запис_фајл = дир.joinpath('запис.tsv')
    запис = tsv.учитај_фајл(запис_фајл, Запис) if запис_фајл.exists() else []

    def додај_запис(ред):
        tsv.додај_на_фајл(запис_фајл, Запис, [ред])

    return {
        "име": дир.name,
        "интервали": интервали,
        "карте": карте,
        "линкови": линкови,
        "запис": запис,
        "додај_запис": додај_запис,
    }


def провери_карта_ид(ид):
    assert len(ид) == 32, f"лоша дужина {ид}"


class Шпил():
    @staticmethod
    def _парсирај_интервале(сви_интервали):
        парсирани = []
        for и in сви_интервали:
            врста_карте, датум = и[0:2]
            датум = date.fromisoformat(датум)
            интервали = и[2:]
            интервали = [int(ј) for ј in интервали]
            assert all(а <= б for (а, б) in zip(интервали[:-1], интервали[1:]))
            парсирани.append((врста_карте, датум, интервали))
        # сортирам по врсти и датуму, да узмем најажурнији интервал
        парсирани = sorted(парсирани, key=lambda т: (т[0], т[1]))
        мапа_интервала = {}
        for врста_карте, _, интервали in парсирани:
            мапа_интервала[врста_карте] = интервали
        return мапа_интервала

    @staticmethod
    def _парсирај_запис(запис):
        нови_интервал = Counter()
        датум_прегледа = {}
        последња_оцена = {}
        for з in запис:
            ид = з[Запис.КАРТА_ИД]
            провери_карта_ид(ид)
            оцена = int(з[Запис.РЕЗУЛТАТ_ПРЕГЛЕДА])
            последња_оцена[ид] = оцена
            if оцена > 0:
                нови_интервал[ид] = int(з[Запис.НОВИ_ИНТЕРВАЛ])
                датум_прегледа[ид] = date.fromisoformat(з[Запис.ДАТУМ_ПРЕГЛЕДА])
        return (нови_интервал, датум_прегледа, последња_оцена)

    @staticmethod
    def _парсирај_линкове(линкови):
        линк_мапа = {}
        for л in линкови:
            ид = л[Линк.ИД]
            урл = л[Линк.УРЛ]
            провери_карта_ид(ид)
            if ид in линк_мапа:
                raise ValueError(f"Дупли линк ид: {ид}")
            линк_мапа[ид] = урл
        return линк_мапа

    def _може_данас(бре, ид, врста_карте):
        данас = date.today()
        давно = date.fromisoformat('1970-01-01')
        дп = бре.датум_прегледа.get(ид, давно)
        ни = timedelta(days=бре.мапа_интервала[врста_карте][бре.нови_интервал[ид]-1])
        return данас > дп + ни

    def _парсирај_карте(бре, карте):
        нађено = False
        дупло = set()
        идјеви = set()
        for карта in карте:
            ид = карта[Карта.ИД]
            if ид in идјеви:
                raise ValueError(f"дупли ид: {ид}")
            идјеви.add(ид)
            питање = f"{карта[Карта.ВРСТА_КАРТЕ]}: {карта[Карта.ПИТАЊЕ]}"
            if питање in дупло:
                print(f"ДУПЛИКАТ: {питање}", file=sys.stderr)
                нађено = True
            дупло.add(питање)
        if нађено:
            raise ValueError("ДУПЛИКАТИ")
        активне = [карта for карта in карте if бре._може_данас(карта[Карта.ИД], карта[Карта.ВРСТА_КАРТЕ])]
        return sorted(активне, key=lambda к: к[Карта.ВРСТА_КАРТЕ])

    def __init__(бре, име, интервали, карте, линкови, запис, додај_запис):
        бре._име = име
        try:
            бре.мапа_интервала = бре._парсирај_интервале(интервали)
            бре.нови_интервал, бре.датум_прегледа, бре.последња_оцена = бре._парсирај_запис(запис)
            бре.линк_мапа = бре._парсирај_линкове(линкови)
            бре.активне = бре._парсирај_карте(карте)
            бре.додај_запис = додај_запис
        except AssertionError as e:
            raise AssertionError(бре._име, e)

    def рандомизуј(бре):
        по_врсти = defaultdict(list)
        for карта in бре.активне:
            врста = карта[Карта.ВРСТА_КАРТЕ]
            по_врсти[врста].append(карта)
        темп = []
        for в in по_врсти.values():
            shuffle(в)
            темп.extend(в)
        бре.активне = темп

    def __len__(бре):
        return len(бре.активне)

    def __iter__(бре):
        return iter(бре.активне)

    def clear(бре):
        бре.активне.clear()

    def урл(бре, ид):
        return бре.линк_мапа.get(извор_ид(ид), None)

    def оцена(бре, ид, оцена):
        try:
            провери_карта_ид(ид)
            assert оцена in [0, 1, 2], оцена
            бре.нови_интервал[ид] = min(бре.нови_интервал[ид] + оцена, МАКС_ИНТЕРВАЛ)
            ред = [
                ид,
                time.strftime('%Y-%m-%d'),
                time.strftime('%H:%M:%S%z'),
                оцена,
                бре.нови_интервал[ид],
            ]
            бре.додај_запис(ред)
        except AssertionError as e:
            raise AssertionError(бре._име, e)

    def име(бре):
        return бре._име

    def преполови(бре):
        бре.активне = бре.активне[::2]

    def избаци_промашене(бре):
        бре.активне = [к for к in бре.активне if бре.последња_оцена.get(к[Карта.ИД], 10000) > 0]

    def задржи_само_промашене(бре):
        бре.активне = [к for к in бре.активне if бре.последња_оцена.get(к[Карта.ИД], 10000) == 0]
