import sys
from random import shuffle
from enum import IntEnum, unique
from collections import defaultdict, namedtuple


@unique
class КартаЕнум(IntEnum):
    ИД = 0
    ВРСТА_КАРТЕ = 1
    ПИТАЊЕ = 2
    ОДГОВОР = 3
    ИЗВОР = 4
    ЛИНИЈА = 5


Карта = namedtuple('Карта', ['ид', 'врста_карте', 'питање', 'одговор', 'извор', 'линија'])


class ФајлКарти():
    def __init__(бре, tsv, путања, сирове_карте):
        бре._tsv = tsv
        бре._путања = путања
        бре._активне = [Карта(*ск) for ск in сирове_карте]
        бре.скуп_врста_карте = set()
        for карта in бре._активне:
            бре.скуп_врста_карте.add(карта.врста_карте)
        нађено = False
        дупло = set()
        идјеви = set()
        for карта in бре._активне:
            ид = карта.ид
            if ид in идјеви:
                raise ValueError(f"дупли ид: {ид}")
            идјеви.add(ид)
            питање = f"{карта.врста_карте}: {карта.питање}"
            if питање in дупло:
                print(f"ДУПЛИКАТ: {питање}", file=sys.stderr)
                нађено = True
            дупло.add(питање)
        if нађено:
            raise ValueError("ДУПЛИКАТИ")
        бре._активне = sorted(бре._активне, key=lambda к: к.врста_карте)

    @staticmethod
    def учитај(tsv, путања):
        сирове_карте = tsv.учитај_фајл(путања, КартаЕнум)
        return ФајлКарти(tsv, путања, сирове_карте)

    def филтрирај(бре, филтер):
        бре._активне = [
            карта for и, карта in enumerate(бре._активне)
            if филтер(и, карта.ид, карта.врста_карте)
        ]

    def рандомизуј(бре):
        по_врсти = defaultdict(list)
        for карта in бре._активне:
            врста = карта.врста_карте
            по_врсти[врста].append(карта)
        темп = []
        for в in по_врсти.values():
            shuffle(в)
            темп.extend(в)
        бре._активне = темп

    def __len__(бре):
        return len(бре._активне)

    def __iter__(бре):
        return iter(бре._активне)

    def clear(бре):
        бре._активне.clear()


def направи_карте(извор_фајл, извор, врста_карте, ф_питање, ф_одговор, индекс):
    """ постарај се да индекс буде јединствен при сваком позиву """
    assert 0 <= индекс and индекс < 16
    карте = []
    for линија, џ in enumerate(извор, 2):
        ид = џ[0]  # претпоставка је да је нулто поље ИД
        assert ид[-1] == '0', 'извор ид мора да се завршава са нулом: ' + ид
        ид = ид[:-1] + hex(индекс)[-1]
        карте.append([ид, врста_карте, ф_питање(џ), ф_одговор(џ), извор_фајл, линија])
    return карте
