class Команда():
    def __init__(бре, кодови):
        if isinstance(кодови, list):
            бре.кодови = кодови
        else:
            бре.кодови = [кодови]

    def __eq__(бре, друго):
        if isinstance(друго, Команда):
            return бре.кодови == друго.кодови
        return False

    def __hash__(бре):
        return sum(hash(код) for код in бре.кодови)

    def __repr__(бре):
        return f"Команда({бре.кодови})"

    def __contains__(бре, код):
        return код in бре.кодови


class Регистар():
    def __init__(бре):
        бре.акције = {}
        бре.парамс = {}

    def региструј(бре, команда, акција, **парамс):
        if бре.акције.get(команда) is not None:
            raise ValueError(f"Команда већ регистрована: {команда}")
        бре.акције[команда] = акција
        бре.парамс[команда] = парамс

    def изврши(бре, код, **дата):
        for команда, акција in бре.акције.items():
            if код in команда:
                парамс = бре.парамс[команда].copy()
                пк = парамс.keys()
                for к in пк:
                    if парамс[к] is None:
                        парамс[к] = дата[к]
                акција(**парамс)
                return True
        return False


КОД_ЛАТ_К = 'k'
КОД_ЛАТ_Ф = 'f'
КОД_ЛАТ_Е = 'e'
КОД_ЛАТ_О = 'o'
КОД_ЛАТ_И = 'i'
КОД_ЛАТ_П = 'p'
КОД_ЛАТ_М = 'm'

КОД_ЦИР_К = 'к'
КОД_ЦИР_Ф = 'ф'
КОД_ЦИР_Е = 'е'
КОД_ЦИР_О = 'о'
КОД_ЦИР_И = 'и'
КОД_ЦИР_П = 'п'
КОД_ЦИР_М = 'м'

КОД_СПЕЈС = ' '
КОД_ЦТРЛ_Ц = '\x03'
КОД_ЕНТЕР = '\r'


def стринг_команда(стр):
    return Команда([стр])


КОМАНДА_ГРЕШКА = Команда([])
КОМАНДА_ПРЕКИД = Команда([КОД_ЦИР_К, КОД_ЛАТ_К, КОД_ЦТРЛ_Ц])
КОМАНДА_ФЕЈЛ = Команда([КОД_ЦИР_Ф, КОД_ЛАТ_Ф])
КОМАНДА_ПЛУС1 = Команда([КОД_СПЕЈС])
КОМАНДА_ПЛУС2 = Команда([КОД_ЕНТЕР])
КОМАНДА_ЕДИТУЈ = Команда([КОД_ЦИР_Е, КОД_ЛАТ_Е])
КОМАНДА_ОТВОРИ_УРЛ = Команда([КОД_ЦИР_О, КОД_ЛАТ_О])
КОМАНДА_ИЗБАЦИ_ПРОМАШЕНЕ = Команда([КОД_ЦИР_И, КОД_ЛАТ_И])
КОМАНДА_ЗАДРЖИ_САМО_ПРОМАШЕНЕ = Команда([КОД_ЦИР_М, КОД_ЛАТ_М])
КОМАНДА_ПРЕПОЛОВИ = Команда([КОД_ЦИР_П, КОД_ЛАТ_П])



