class Команда():
    def __init__(бре, кодови):
        if isinstance(кодови, list):
            бре.кодови = кодови
        else:
            бре.кодови = [кодови]

    def __eq__(бре, друго):
        if isinstance(друго, Команда):
            return бре.кодови == друго.кодови
        return False

    def __repr__(бре):
        return f"Команда({бре.кодови})"

    def __contains__(бре, код):
        return код in бре.кодови

    def индекс(бре):
        if len(бре.кодови) != 1:
            raise ValueError(f"Није индекс: {бре}")
        return int(бре.кодови[0])


КОМАНДА_ПРЕКИД = Команда(['k', 'к', '\x03'])
КОМАНДА_ФЕЈЛ = Команда(['ф', 'f'])
КОМАНДА_ПЛУС1 = Команда([' '])
КОМАНДА_ПЛУС2 = Команда(['\r'])
КОМАНДА_ЕДИТУЈ = Команда(['е', 'e'])
КОМАНДА_ОТВОРИ_УРЛ = Команда(['о', 'o'])
КОМАНДА_ИЗБАЦИ_ПРОМАШЕНЕ = Команда(['и', 'i'])
КОМАНДА_ПРЕПОЛОВИ = Команда(['п', 'p'])
КОМАНДА_ГРЕШКА = Команда([])
