class Команда():
    def __init__(бре, кодови):
        бре.кодови = кодови

    def __eq__(бре, друго):
        if isinstance(друго, Команда):
            return бре.кодови == друго.кодови
        return False

    def __repr__(бре):
        return f"Команда({бре.кодови})"

    def има(бре, код):
        return код in бре.кодови


КОМАНДА_ПРЕКИД = Команда(['\x03', 'k', 'к'])
КОМАНДА_ФЕЈЛ = Команда(['ф', 'f'])
КОМАНДА_ПЛУС1 = Команда([' '])
КОМАНДА_ПЛУС2 = Команда(['\r'])
КОМАНДА_ЕДИТУЈ = Команда(['е', 'e'])
КОМАНДА_ОТВОРИ_УРЛ = Команда(['о', 'o'])
