# TODO: *ars u __init__
class Команда():
    def __init__(бре, кодови):
        if isinstance(кодови, list):
            бре.кодови = кодови
        else:
            бре.кодови = [кодови]

    def __eq__(бре, друго):
        if isinstance(друго, Команда):
            return бре.кодови == друго.кодови
        return False

    def __repr__(бре):
        return f"Команда({бре.кодови})"

    def __contains__(бре, код):
        return код in бре.кодови

    def индекс(бре):
        if len(бре.кодови) != 1:
            raise ValueError(f"Није индекс: {бре}")
        return int(бре.кодови[0])


КОД_ЛАТ_К = 'k'
КОД_ЛАТ_Ф = 'f'
КОД_ЛАТ_Е = 'e'
КОД_ЛАТ_О = 'o'
КОД_ЛАТ_И = 'i'
КОД_ЛАТ_П = 'p'

КОД_ЦИР_К = 'к'
КОД_ЦИР_Ф = 'ф'
КОД_ЦИР_Е = 'е'
КОД_ЦИР_О = 'о'
КОД_ЦИР_И = 'и'
КОД_ЦИР_П = 'п'

КОД_СПЕЈС = ' '
КОД_ЦТРЛ_Ц = '\x03'
КОД_ЕНТЕР = '\r'

КОМАНДА_ГРЕШКА = Команда([])
КОМАНДА_ПРЕКИД = Команда([КОД_ЦИР_К, КОД_ЛАТ_К, КОД_ЦТРЛ_Ц])
КОМАНДА_ФЕЈЛ = Команда([КОД_ЦИР_Ф, КОД_ЛАТ_Ф])
КОМАНДА_ПЛУС1 = Команда([КОД_СПЕЈС])
КОМАНДА_ПЛУС2 = Команда([КОД_ЕНТЕР])
КОМАНДА_ЕДИТУЈ = Команда([КОД_ЦИР_Е, КОД_ЛАТ_Е])
КОМАНДА_ОТВОРИ_УРЛ = Команда([КОД_ЦИР_О, КОД_ЛАТ_О])
КОМАНДА_ИЗБАЦИ_ПРОМАШЕНЕ = Команда([КОД_ЦИР_И, КОД_ЛАТ_И])
КОМАНДА_ПРЕПОЛОВИ = Команда([КОД_ЦИР_П, КОД_ЛАТ_П])



