# random magic number
# _ГРЕШКА = -327304501


# def више(терминал, листа, опис):
#     индекси = set()
#     while True:
#         терминал.обриши()
#         with терминал.статус():
#             терминал.принт_сепаратор('=')
#             терминал.принт(опис)
#         with терминал.главни():
#             принт(терминал, листа, индекси)
#             индекс = унеси_индекс(терминал, len(листа))
#             if индекс in индекси:
#                 индекси.remove(индекс)
#             elif индекс == _КРАЈ:
#                 if len(индекси) > 0:
#                     return индекси
#                 терминал.звук_грешке()
#             elif индекс == _СВЕ:
#                 if len(индекси) > 0:
#                     индекси.clear()
#                 else:
#                     индекси.update(range(1, len(листа) + 1))
#             elif индекс == _ГРЕШКА:
#                 терминал.звук_грешке()
#             else:
#                 индекси.add(индекс)
