from наки.команда import КОМАНДА_ПРЕКИД, КОМАНДА_ОТВОРИ_УРЛ, КОМАНДА_ЕДИТУЈ
from наки.команда import КОМАНДА_ФЕЈЛ, КОМАНДА_ПЛУС1, КОМАНДА_ПЛУС2


class ОдговорUI():
    def __init__(бре, терминал, регистар_одговор):
        бре.т = терминал
        бре._претходни_текст = None
        бре._зелено = False
        бре._регистар_одговор = регистар_одговор

    def на_прекид(бре, фунц):
        бре._регистар_одговор.региструј(КОМАНДА_ПРЕКИД, фунц)

    def на_отвори_урл(бре, фунц, **парамс):
        бре._регистар_одговор.региструј(КОМАНДА_ОТВОРИ_УРЛ, фунц, **парамс)

    def на_едитуј(бре, фунц, **парамс):
        бре._регистар_одговор.региструј(КОМАНДА_ЕДИТУЈ, фунц, **парамс)

    def на_фејл(бре, фунц, **парамс):
        бре._регистар_одговор.региструј(КОМАНДА_ФЕЈЛ, фунц, **парамс)

    def на_плус1(бре, фунц, **парамс):
        бре._регистар_одговор.региструј(КОМАНДА_ПЛУС1, фунц, **парамс)

    def на_плус2(бре, фунц, **парамс):
        бре._регистар_одговор.региструј(КОМАНДА_ПЛУС2, фунц, **парамс)

    def _принт_мд(бре, текст):
        """ принт маркдовн текст """
        assert текст is not None
        for т in бре.т.формат_мд(текст).split('\\n'):
            бре.т.принт(т)

    def _принт_наслов(бре, текст):
        промена_врсте = False
        if бре._претходни_текст is None:
            бре._претходни_текст = текст
        if бре._претходни_текст != текст:
            бре._зелено = not бре._зелено
            промена_врсте = True
        бре._претходни_текст = текст
        if бре._зелено:
            бре.т.принт_зелено(текст)
        else:
            бре.т.принт_плаво(текст)
        бре.т.принт()
        return промена_врсте

    def _принт_сепаратор(бре, c, број=None):
        if број is None:
            бре.т.принт_сиво(c * 60)
        else:
            бре.т.принт_сиво((c * 1) + f"[{број}]" + (c * (59 - len(f"[{број}]"))))

    def _принт_питање(бре, наслов, питање, број_преосталих_карата):
        промена_врсте = бре._принт_наслов(наслов)
        бре._принт_мд(питање)
        бре._принт_сепаратор('-')
        with бре.т.статус():
            бре._принт_сепаратор('=', број_преосталих_карата)
            бре.т.принт('притисни било који тастер')
        return промена_врсте

    def одговор(бре, дата, наслов, питање, одговор, број_преосталих_карата):
        with бре.т.пун_екран():
            with бре.т.сакривен_курсор():
                бре.т.обриши()
                with бре.т.главни():
                    бре._принт_питање(наслов, питање, број_преосталих_карата)
                    бре._принт_мд(одговор)
                    with бре.т.статус():
                        бре._принт_сепаратор('=', број_преосталих_карата)
                        бре.т.принт('оцени одговор (f: 0)(space: +1)(enter: +2)')
                        к = бре.т.инпут_код()
                        if бре._регистар_одговор.изврши(к, **дата):
                            return
                        бре.т.звук_грешке()

    def отвори_урл(бре, урл):
        бре.т.отвори_урл(урл)

    def измени(бре, путања, линија):
        бре.т.измени(путања, линија)

    def додај_нa_извор(бре, путања):
        бре.т.додај_на_извор(путања)
