from наки.ui import UI


class ОдговорUI(UI):
    def __init__(бре, стање, терминал, регистар):
        super().__init__(стање, терминал, регистар)

    def одговор(бре, дата, наслов, питање, одговор, број_преосталих_карата):
        with бре.т.пун_екран():
            with бре.т.сакривен_курсор():
                бре.т.обриши()
                with бре.т.главни():
                    бре._принт_наслов(наслов)
                    бре._принт_питање(питање, број_преосталих_карата)
                    бре._принт_мд(одговор)
                    with бре.т.статус():
                        бре._принт_сепаратор('=', број_преосталих_карата)
                        бре.т.принт('оцени одговор (f: 0)(space: +1)(enter: +2)')
                        к = бре.т.инпут_код()
                        if бре._регистар.изврши(к, **дата):
                            return
                        бре.т.звук_грешке()

