from наки.конфигурација import ПУТАЊА_КАТАЛОГА
from наки.__main__ import ГлавнаЗидар


class Статистика:
    def __init__(бре, име, карте, запис):
        бре.име = име
        бре.карте = карте
        бре.запис = запис

    def непогледане(бре):
        к = бре.карте.стат_скуп_идјева()
        з = бре.запис.стат_скуп_идјева()
        return len(к.difference(з))

    def у_интервалу(бре):
        return бре.запис.стат_број_карти_по_интервалу()

    def проценат_промашених(бре):
        return бре.запис.стат_проценат_промашених_карти()

    def укупно(бре):
        return len(бре.карте)

    def штампај(бре):
        print('=' * 79)
        print(бре.име)
        print(f"непогледане={бре.непогледане()}")
        print(f"у_интервалу={бре.у_интервалу()}")
        print(f"проценат_промашених={бре.проценат_промашених()}%")
        print(f"укупно={бре.укупно()}")


def главна():
    г = ГлавнаЗидар(ПУТАЊА_КАТАЛОГА)()
    for вежбање in г.вежбања:
        шпил = вежбање.шпил
        шпил.припреми()
        Статистика(шпил.име(), шпил.п_карти, шпил.п_записа).штампај()


if __name__ == '__main__':
    главна()

