from наки import tsv
from наки.карте import Карта, Запис
from наки.конфигурација import ПУТАЊА_КАТАЛОГА


class Статистика:
    def __init__(бре, шпил, карте, запис):
        бре.шпил = шпил
        бре.карте = карте
        бре.запис = запис

    def непогледане(бре):
        к = set(и[Карта.ИД] for и in бре.карте)
        з = set(и[Запис.КАРТА_ИД] for и in бре.запис)
        return len(к.difference(з))

    def у_интервалу(бре):
        задњи_интервали = {}
        for за in бре.запис:
            задњи_интервали[за[Запис.КАРТА_ИД]] = int(за[Запис.НОВИ_ИНТЕРВАЛ])
        рез = [0] * 10
        for _, зи in задњи_интервали.items():
            рез[зи] += 1
        return рез

    def проценат_промашених(бре):
        пром = len([за for за in бре.запис if int(за[Запис.РЕЗУЛТАТ_ПРЕГЛЕДА]) == 0])
        return int(100 * пром / len(бре.запис))

    def укупно(бре):
        return len(бре.карте)

    def штампај(бре):
        print('=' * 79)
        print(бре.шпил.name)
        print(f"непогледане={бре.непогледане()}")
        print(f"у_интервалу={бре.у_интервалу()}")
        print(f"проценат_промашених={бре.проценат_промашених()}%")
        print(f"укупно={бре.укупно()}")


def главна():
    шпилови = [шпил for шпил in ПУТАЊА_КАТАЛОГА.iterdir() if шпил.is_dir() and not шпил.name.startswith('__')]
    for шпил in шпилови:
        карте_путања = шпил.joinpath('карте.tsv')
        карте = tsv.учитај_фајл(карте_путања, Карта)
        запис_путања = шпил.joinpath('запис.tsv')
        запис = tsv.учитај_фајл(запис_путања, Запис)
        Статистика(шпил, карте, запис).штампај()


if __name__ == '__main__':
    главна()
