import readchar
from blessings import Terminal


class Терминал():
    УРЕЗ = ' ' * 40
    СИВА = 7
    CTRL_C = '\x03'
    ЕНТЕР = '\r'
    СПЕЈС = ' '
    CYR_E = 'е'
    CYR_F = 'ф'
    CYR_O = 'о'

    def __init__(ја, **kw):
        ја.т = Terminal(**kw)
        ја._претходни_текст = ""
        ја._зелено = False

    def пун_екран(ја):
        return ја.т.fullscreen()

    def сакривен_курсор(ја):
        return ја.т.hidden_cursor()

    def обриши(ја):
        print(ја.т.clear)

    def главни(ја):
        return ја.т.location(0, 9)

    def статус(ја):
        return ја.т.location(0, ја.т.height-9)

    def инпут(ја, текст):
        return input(Терминал.УРЕЗ + текст)

    def принт(ја, *args, **kw):
        print(Терминал.УРЕЗ, end='')
        print(*args, **kw)

    def формат_мд(ја, текст):
        """ текст са [болд] и {плавим} нагласцима """
        текст = текст.replace('[[', 'ДУПЛЕ_КОЦКАСТЕ_ЛЕВЕ').replace(']]', 'ДУПЛЕ_КОЦКАСТЕ_ДЕСНЕ')
        текст = текст.replace('[', 'ЈЕДНА_КОЦКАСТА_ЛЕВА').replace(']', 'ЈЕДНА_КОЦКАСТА_ДЕСНА')
        текст = текст.replace('{{{', 'ТРОСТРУКЕ_ВИТИЧАСТЕ_ЛЕВЕ').replace('}}}', 'ТРОСТРУКЕ_ВИТИЧАСТЕ_ДЕСНЕ')
        текст = текст.replace('{{', 'ДУПЛЕ_ВИТИЧАСТЕ_ЛЕВЕ').replace('}}', 'ДУПЛЕ_ВИТИЧАСТЕ_ДЕСНЕ')
        текст = текст.replace('{', 'ЈЕДНА_ВИТИЧАСТА_ЛЕВА').replace('}', 'ЈЕДНА_ВИТИЧАСТА_ДЕСНА')
        текст = текст.replace('ДУПЛЕ_КОЦКАСТЕ_ЛЕВЕ', '[').replace('ДУПЛЕ_КОЦКАСТЕ_ДЕСНЕ', ']')
        текст = текст.replace('ДУПЛЕ_ВИТИЧАСТЕ_ЛЕВЕ', '{').replace('ДУПЛЕ_ВИТИЧАСТЕ_ДЕСНЕ', '}')
        текст = текст.replace('ЈЕДНА_КОЦКАСТА_ЛЕВА', ја.т.bold).replace('ЈЕДНА_КОЦКАСТА_ДЕСНА', ја.т.normal)
        текст = текст.replace('ЈЕДНА_ВИТИЧАСТА_ЛЕВА', ја.т.blue).replace('ЈЕДНА_ВИТИЧАСТА_ДЕСНА', ја.т.normal)
        текст = текст.replace('ТРОСТРУКЕ_ВИТИЧАСТЕ_ЛЕВЕ', ја.т.blue + '{')
        текст = текст.replace('ТРОСТРУКЕ_ВИТИЧАСТЕ_ДЕСНЕ', '}' + ја.т.normal)
        return текст

    def принт_мд(ја, текст):
        """ принт маркдовн текст """
        for т in ја.формат_мд(текст).split('\\n'):
            ја.принт(т)

    def принт_наслов(ја, текст):
        if ја._претходни_текст != текст:
            ја._зелено = not ја._зелено
        ја._претходни_текст = текст
        if ја._зелено:
            ја.принт(ја.т.green(текст))
        else:
            ја.принт(ја.т.blue(текст))
        ја.принт()

    def принт_сепаратор(ја, c, број=None):
        if број is None:
            ја.принт(ја.т.color(Терминал.СИВА) + (c * 60) + ја.т.normal)
        else:
            ја.принт(ја.т.color(Терминал.СИВА) + (c * 1) + f"[{број}]" + (c * (59 - len(f"[{број}]"))) + ја.т.normal)

    def звук_грешке(ја):
        print('\a', end='', flush=True)

    def учитај_кључ(ја, дозвољени_кључеви=None):
        if дозвољени_кључеви:
            while True:
                к = readchar.readkey()
                if к in дозвољени_кључеви:
                    return к
                elif к == Терминал.CTRL_C:
                    return к
                else:
                    ја.звук_грешке()
        return readchar.readkey()

    def јели_прекид_кључ(ја, кључ):
        return кључ == Терминал.CTRL_C
