from наки.терминал import Терминал
from наки.конфигурација import ПУТАЊА_КАТАЛОГА
from наки.команда import Регистар, КОМАНДА_ПРЕКИД
from наки.команда import команда_индекс
from наки.ui import UI


class Унос():
    def __init__(бре, дир):
        бре.дир = дир
        бре.број_позива = 0

    def __len__(бре):
        return 100

    def име(бре):
        return бре.дир.name

    def __call__(бре, ui):
        бре.број_позива += 1
        ui.додај_нa_извор(бре.дир.joinpath('извор', 'извор.tsv'))

    def сиже(бре):
        return бре.број_позива


class Главна():

    @staticmethod
    def направи(каталог):
        дирови = [фајл for фајл in каталог.iterdir() if фајл.is_dir() and not фајл.name.startswith('__')]
        уноси = [Унос(дир) for дир in дирови]
        уноси.sort(key=lambda у: у.дир)
        return Главна(UI(Терминал()), уноси)

    def __init__(бре, ui, уноси):
        бре.ui = ui
        бре.уноси = уноси
        бре.прекид = False
        бре.регистар = Регистар()
        бре.регистар.региструј(КОМАНДА_ПРЕКИД, бре.а_прекид)
        бре.регистар.региструј(команда_индекс(len(бре.уноси)), бре.а_индекс)

    def а_прекид(бре, к):
        бре.прекид = True

    def а_индекс(бре, к):
        бре.уноси[int(к) - 1](бре.ui)

    def __call__(бре):
        порука = [
            'бројем одабери шпил',
            '"к" за крај',
        ]
        while not бре.прекид:
            приказ = [у.име() for у in бре.уноси]
            бре.ui.одабери_шпил(приказ, порука, бре.регистар)
        return [у.сиже() for у in бре.уноси]


def главна():
    Главна.направи(ПУТАЊА_КАТАЛОГА)()


if __name__ == '__main__':
    главна()
