from pathlib import Path
from наки.tsv import ЗаглављеГрешка, ПарсирањеГрешка


class ТестTSV():
    def __init__(бре, на_диску):
        бре._на_диску = на_диску

    def учитај(бре, путања, неко):
        """ учитај фајл и парсирај елементе """
        assert isinstance(путања, Path), путања
        елементи = []
        for и, ред in enumerate(бре._на_диску, 1):
            if и == 1:
                заг = неко.заглавље()
                if ред != заг:
                    raise ЗаглављеГрешка(f"Заглавље се не поклапа: {заг} {ред}")
            else:
                try:
                    елементи.append(неко.елемент(ред))
                except Exception as е:
                    raise ПарсирањеГрешка(f'(линија:{и}){ред}', е)
        return елементи

    def додај(бре, путања, неко, елементи):
        assert isinstance(путања, Path), путања
        """ додај елементе на крај фајла """
        додај_заглавље = False
        if бре._на_диску:
            ред = бре._на_диску[0]
            заг = неко.заглавље()
            if ред != заг:
                raise ЗаглављеГрешка(f"Заглавље се не поклапа: {заг} {ред}")
        else:
            додај_заглавље = True
        if додај_заглавље:
            бре._на_диску.append(неко.заглавље())
        for елемент in елементи:
            бре._на_диску.append(неко.ред(елемент))

