import time
import uuid
import random
from pathlib import Path
from hashlib import sha256
from каталог.__main__ import направи_карте
from наки.__main__ import ГлавнаЗидар, ВежбањеЗидар
from тест.tsv import Табела
from тест.терминал import ТестТерминал
from наки.интервали import Интервали
from наки.запис import Запис
from наки.линкови import Линк
from наки.карте import Карта


def фајл_хеш(path1):
    with open(path1, 'r') as ф:
        садржај = ф.read()
        м = sha256()
        м.update(bytes(садржај, 'utf-8'))
        return м.hexdigest()


class ТестВежбањеЗидар(ВежбањеЗидар):
    def __init__(бре, ui, каталог, дир, лен):
        super().__init__(ui, каталог, дир)
        бре.шпил_лоадер(дир, лен)

    def шпил_лоадер(бре, дир, лен):
        дир = Path(дир)
        карте = []
        линкови = []
        for извор_фајл in ['aaa.tsv', 'bbb.tsv', 'ccc.tsv']:
            лепа_путања = дир.joinpath('извор', извор_фајл)
            извор = извор_учитај(извор_фајл)
            к, л = извор_одради(лепа_путања, извор)
            карте.extend(к)
            линкови.extend(л)
        карте = карте[:лен]
        скуп_врста_карте = set()
        ВРСТА_КАРТЕ = 1  # индекс поља
        for карта in карте:
            скуп_врста_карте.add(карта[ВРСТА_КАРТЕ])
        интервали = []
        for врста_карте in скуп_врста_карте:
            интервали.append([врста_карте, "2019-12-07", "1, 6, 15, 38, 94, 234, 586, 1465, 3662"])
        линкови = линкови[:лен]
        запис = []
        for и, карта in enumerate(карте):
            if и % 4 == 0:
                запис.append([карта[0], "2020-03-28", "3:34:53+0100", "0", "1"])
            # TODO dodaj pregledane danas, isto kao cetvrtinu

        бре.интервали = [['ВРСТА_КАРТЕ', 'ДАТУМ', 'ИНТЕРВАЛИ']]
        бре.интервали.extend(интервали)

        бре.карте = [['ИД', 'ВРСТА_КАРТЕ', 'ПИТАЊЕ', 'ОДГОВОР', 'ИЗВОР', 'ЛИНИЈА']]
        бре.карте.extend(карте)

        бре.линкови = [['ИД', 'УРЛ']]
        бре.линкови.extend(линкови)

        бре.запис = [['КАРТА_ИД', 'ДАТУМ_ПРЕГЛЕДА', 'ВРЕМЕ_ПРЕГЛЕДА', 'РЕЗУЛТАТ_ПРЕГЛЕДА', 'НОВИ_ИНТЕРВАЛ']]
        бре.запис.extend(запис)

    def т_интервала(бре, путања):
        return Табела(путања, Интервали, бре.интервали)

    def т_карти(бре, путања):
        return Табела(путања, Карта, бре.карте)

    def т_линкова(бре, путања):
        return Табела(путања, Линк, бре.линкови)

    def т_записа(бре, путања):
        return Табела(путања, Запис, бре.запис)


class ТестГлавнаЗидар(ГлавнаЗидар):
    def __init__(бре, каталог, команде, дужине):
        super().__init__(каталог)
        бре.команде = команде
        бре.дужине = дужине

    def дирови(бре):
        return [бре.каталог.joinpath('meh', str(и)) for и, _ in enumerate(бре.дужине)]

    def терминал(бре):
        return ТестТерминал(бре.команде)

    def листа_вежбања(бре):
        return [ТестВежбањеЗидар(бре.ui(), бре.каталог, дир, лен)() for (дир, лен) in zip(бре.дирови(), бре.дужине)]


def направи_линк(извор):
    ид = извор[0]
    питање = 'ли' + str(random.random())[2:]
    return [ид, f"https://www.google.de/search?tbm=isch&q={питање}"]


def извор_одради(лепа_путања, извор):
    карте = []
    индекс = iter(range(16))

    # 0, 1
    def питање(џ):
        return 'пи' + str(random.random())[2:]

    def одговор(џ):
        return 'од' + str(random.random())[2:]

    for и in range(1, 12):
        карте.extend(направи_карте(лепа_путања, извор, f"ТИП{и}", питање, одговор, next(индекс)))
    линкови = [направи_линк(и) for и in извор]
    return карте, линкови


def _рандом_датум():
    пет_година = 60*60*24*365*5
    данас = time.mktime(time.localtime())
    датум = time.localtime(данас - random.randint(0, пет_година))
    return time.strftime("%Y-%m-%d", датум)


def извор_учитај(путања):
    рез = []
    for _ in range(10):
        рез.append([
            uuid.uuid4().hex[:-1] + '0',
            _рандом_датум(),
            'ле' + str(random.random())[2:],
            'де' + str(random.random())[2:],
        ])
    return рез


